<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of DbVisualizer and imports it into Munki.</string>
		<key>Identifier</key>
		<string>se.new-work.autopkg.download.dbvisualizer</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>DbVisualizer</string>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.0</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>URLTextSearcher</string>
				<key>Arguments</key>
				<dict>
					<key>re_pattern</key>
					<string>(https://dbvis.com/product_download/dbvis-[\S]+\/media/dbvis_macos-%ARCHITECTURE%_[\S]+\.dmg)</string>
					<key>url</key>
					<string>https://www.dbvis.com/download</string>
                    <key>result_output_var_name</key>
                    <string>download_url</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>URLDownloader</string>
				<key>Arguments</key>
				<dict>
                    <key>url</key>
                    <string>%download_url%</string>
					<key>filename</key>
					<string>%NAME%.dmg</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
			<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/DbVisualizer.app</string>
				<key>requirement</key>
				<string>always</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>input_plist_path</key>
					<string>%pathname%/DbVisualizer.app/Contents/Info.plist</string>
					<key>plist_version_key</key>
					<string>CFBundleShortVersionString</string>
				</dict>
				<key>Processor</key>
				<string>Versioner</string>
			</dict>
			</array>
	</dict>
</plist>
