<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of DbSchema and imports it into Munki.</string>
	<key>Identifier</key>
	<string>se.new-work.autopkg.munki.DbSchema</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>DbSchema</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>DbSchema is for visual designing the schema in a team, deploy and document the schema. Other integrated features like data explorer, visual query editor, data generator, etc., makes DbSchema an every-day tool for everybody who interacts with databases.

DbSchema supports all relational and No-SQL databases, including MySQL, PostgreSQL, SQLite, Microsoft SQL Server, MongoDB, MariaDB, Redshift, Snowflake, Google and more.

DbSchema Free is one of the most powerful tools in its market area.</string>
			<key>developer</key>
			<string>Pruteanu Dragos</string>
			<key>display_name</key>
			<string>DbSchema</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>se.new-work.autopkg.download.DbSchema</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
				<key>dmg_root</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
			</dict>
			<key>Processor</key>
			<string>DmgCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%dmg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
