<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest XMind disk image.</string>
    <key>Identifier</key>
    <string>se.new-work.autopkg.download.XMind</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>XMind</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>XMindURLProvider</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
            	<key>url</key>
                <string>https://dl3.xmind.net/%filename%</string> <!-- USE %url% IF IT'S NOT WORKING -->
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>info_path</key>
                <string>%pathname%/XMind.app/Contents/Info.plist</string>
                <key>plist_keys</key>
				<dict>
					<key>CFBundleShortVersionString</key>
					<string>version2</string>
				</dict>
            </dict>
            <key>Processor</key>
            <string>PlistReader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/XMind.app</string>
                <key>requirement</key>
                <string>identifier "org.xmind.cathy.application" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "4WV38P2X5K"</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
